slideCounter = 0;
document.addEventListener("DOMContentLoaded", function() {
  buttons = document.getElementsByClassName('slide');
  leftButton = buttons[0];
  rightButton = buttons[1];
  galleryContent = document.getElementById('gallery-content');
  galleryContent.innerHTML = slides[slideCounter];
});
slides = ["<img src=\"./images/checkers-bg.jpg\"/><p>Шашки е настолна логическа игра за двама, подобна на шаха. Играе се на шахматна дъска с бели и черни редуващи се квадратчета. Шашките са белите и черните фигури, които в началото на играта са равноправни. Фигурите са разположени само в черните полета на шахматната дъска и могат да се придвижват по диагонал и да взимат противникови фигури на пътя си. При достигане на срещуположния край на дъската, фигурите се превръщат в \"царе\", което им позволява да се движат по диагонал не само напред, но и назад.</p>",
"<img src=\"./images/EgyptianCheckers.jpg\"/><div><p>Играта има древна история. Счита се, че произхожда от Древен Египет, където археолозите са открили дъски, датиращи от 3000г. пр. Хр. Артефактите потвърждават, че някои фараони, сред които Хатшепсут, са играли шашки по фигурите и дъските, открити в гробниците им.</p><p>За играта по-късно разказват Платон и Омир. Римляните разработват вариант на играта, наречен latrunculi, или \"игра на малките войници\".</p></div>",
"<img src=\"./images/Playing-at-Draughts.jpg\"/><p>Съвременния си вид, играта придобива през Средновековието. Арабите създават играта \"Ал-Кирк\", която се играе на дъска 5x5, и я пренасят в Испания, където я наричат \"Алкерке\". В началото на дванадесети век играта достига и до Франция, където е адаптирана, за да се играе на шахматна дъска. Наричат я Fierges. Английският писател Самюел Джонсън допринася за популяризирането на играта, като написва предговор към книга за играта шашки, написана от английския математик Уилям Пейн през 1756 г. Това е най-ранната книга на английски език за играта.</p>",
"<img src=\"./images/CheckersTournament.jpg\"/><div><p>Днес играта е разпространена по целия свят и се среща в няколко вариации - Checkers (САЩ), draughts (Великобритания), руски шашки, турски шашки, международни шашки и други. Повечето варианти се играят на дъска 8x8, а международните шашки - на дъска 10x10.</p><p>Играта е популярна и на турнири, където традиционно се играе в международния си вариант, като една игра традиционно отнема от 60 минути до 3 часа.</p></div>"];



function nextSlide(){
  if (slideCounter == 0) {
    leftButton.disabled = false;
  }
  slideCounter ++;
  if(slideCounter +1 == slides.length){
   rightButton.disabled = true; 
  }
  galleryContent.innerHTML = slides[slideCounter];
}

function previousSlide() {
  if(slideCounter + 1 == slides.length) {
    rightButton.disabled = false;
  }
  slideCounter --;
  if (slideCounter == 0){
    leftButton.disabled = true;
  }
  galleryContent.innerHTML = slides[slideCounter];
}
